In [1]:
import pandas as pd

# Menghapus Data

In [2]:
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";")

In [3]:
df_aps.head()

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI

## Menghapus kolom

Ada dua metode:
- `del`
- `drop`

### del

In [4]:
del df_aps["nama_variabel_turunan"]

In [5]:
df_aps.head()

,nama_variabel,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,NaN,JAMBI

‚ö†Ô∏è *Keyword* `del` akan menghapus kolom secara langsung (*in-place*). Apabila Anda ingin menggunakan `del`, pastikan bahwa Anda menghapus kolom yang benar. Apabila Anda ingin mencoba-coba dulu tanpa menghapus data yang sebenarnya, gunakan metode `drop` tanpa menempatkan *dataframe* Anda ke sebuah variabel.

### drop

üìñ  Dokumentasi `pandas.drop`: [tautan](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

- `axis`: bernilai 0 atau `index` apabila ingin menghapus label dari indeks; bernilai 1 apabila ingin menghapus kolom.
- `inplace`: `True` apabila operasi akan dilakukan ditempat; `False` apabila sebaliknya.

In [6]:
df_aps.drop("nama_turunan_tahun", axis=1).head()

,nama_variabel,nama_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),2011,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),2011,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),2011,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),2011,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),2011,NaN,JAMBI

In [7]:
df_aps.head()

,nama_variabel,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),2011,Tahun,NaN,JAMBI

In [8]:
df_aps_deleted = df_aps.drop("nama_turunan_tahun", axis=1).head()

In [9]:
df_aps_deleted.head()

,nama_variabel,nama_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),2011,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),2011,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),2011,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),2011,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),2011,NaN,JAMBI

In [10]:
df_aps.drop("nama_turunan_tahun", axis=1, inplace=True)

In [11]:
df_aps.head()

,nama_variabel,nama_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),2011,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),2011,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),2011,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),2011,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),2011,NaN,JAMBI

In [12]:
df_aps = df_aps.drop("nama_variabel", axis=1)

In [13]:
df_aps.head()

   nama_tahun data_content nama_item_vertical_variabel
0        2011        98.99                        ACEH
1        2011        98.34              SUMATERA UTARA
2        2011        98.09              SUMATERA BARAT
3        2011        97.68                        RIAU
4        2011          NaN                       JAMBI

### Latihan
Hapus tiga kolom (nama_variabel, nama_variabel_turunan, dan nama_turunan_tahun) dalam satu kode sekaligus

In [14]:
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";")

#### Hint

Anda bisa lihat di [dokumentasinya](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) bahwa metode `drop` tidak hanya menerima satu label saja, tapi juga menerima *list*.

#### Solusi 1

In [15]:
dropped_columns = ["nama_variabel", "nama_variabel_turunan", "nama_turunan_tahun"]
df_aps = df_aps.drop(dropped_columns, axis=1)

In [16]:
df_aps.head()

   nama_tahun data_content nama_item_vertical_variabel
0        2011        98.99                        ACEH
1        2011        98.34              SUMATERA UTARA
2        2011        98.09              SUMATERA BARAT
3        2011        97.68                        RIAU
4        2011          NaN                       JAMBI

#### Solusi 2

In [17]:
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";")

In [18]:
df_aps.drop(dropped_columns, axis=1, inplace=True)

In [19]:
df_aps.head()

   nama_tahun data_content nama_item_vertical_variabel
0        2011        98.99                        ACEH
1        2011        98.34              SUMATERA UTARA
2        2011        98.09              SUMATERA BARAT
3        2011        97.68                        RIAU
4        2011          NaN                       JAMBI

## Menghapus baris

### Menghapus baris berdasarkan indeks

In [20]:
df_aps.drop([0, 1])

      nama_tahun     data_content nama_item_vertical_variabel
2           2011            98.09              SUMATERA BARAT
3           2011            97.68                        RIAU
4           2011              NaN                       JAMBI
5           2011            97.95            SUMATERA SELATAN
6           2011            98.41                    BENGKULU
...          ...              ...                         ...
1256        2019  31.232309871373                MALUKU UTARA
1257        2019  31.476599698978                 PAPUA BARAT
1258        2019  22.912638443325                       PAPUA
1259        2019  25.209832165788                   INDONESIA
1260        2019  25.209832165788                   INDONESIA

[1259 rows x 3 columns]

### Menghapus baris berdasarkan nilai di sebuah kolom
Menghapus baris di mana `turvar` = 'Sekolah Dasar':

In [21]:
df_aps[df_aps.nama_item_vertical_variabel != 'SUMATERA BARAT']

      nama_tahun     data_content nama_item_vertical_variabel
0           2011            98.99                        ACEH
1           2011            98.34              SUMATERA UTARA
3           2011            97.68                        RIAU
4           2011              NaN                       JAMBI
5           2011            97.95            SUMATERA SELATAN
...          ...              ...                         ...
1256        2019  31.232309871373                MALUKU UTARA
1257        2019  31.476599698978                 PAPUA BARAT
1258        2019  22.912638443325                       PAPUA
1259        2019  25.209832165788                   INDONESIA
1260        2019  25.209832165788                   INDONESIA

[1225 rows x 3 columns]

### Menghapus baris berdasarkan nomor baris

Pada contoh di bawah, kita akan menghapus baris pertama atau baris ke-0:

In [22]:
df_aps.drop(df_aps.index[0])

      nama_tahun     data_content nama_item_vertical_variabel
1           2011            98.34              SUMATERA UTARA
2           2011            98.09              SUMATERA BARAT
3           2011            97.68                        RIAU
4           2011              NaN                       JAMBI
5           2011            97.95            SUMATERA SELATAN
...          ...              ...                         ...
1256        2019  31.232309871373                MALUKU UTARA
1257        2019  31.476599698978                 PAPUA BARAT
1258        2019  22.912638443325                       PAPUA
1259        2019  25.209832165788                   INDONESIA
1260        2019  25.209832165788                   INDONESIA

[1260 rows x 3 columns]

Di contoh berikutnya, kita akan menghapus baris ketiga dan keempat.

‚ö†Ô∏è  Karena pandas mulai menghitung dari 0, maka:
- Baris ke-3: 2
- Baris ke-4: 3

In [23]:
df_aps.head()

   nama_tahun data_content nama_item_vertical_variabel
0        2011        98.99                        ACEH
1        2011        98.34              SUMATERA UTARA
2        2011        98.09              SUMATERA BARAT
3        2011        97.68                        RIAU
4        2011          NaN                       JAMBI

In [24]:
df_aps.drop(df_aps.index[[2, 3]])

      nama_tahun     data_content nama_item_vertical_variabel
0           2011            98.99                        ACEH
1           2011            98.34              SUMATERA UTARA
4           2011              NaN                       JAMBI
5           2011            97.95            SUMATERA SELATAN
6           2011            98.41                    BENGKULU
...          ...              ...                         ...
1256        2019  31.232309871373                MALUKU UTARA
1257        2019  31.476599698978                 PAPUA BARAT
1258        2019  22.912638443325                       PAPUA
1259        2019  25.209832165788                   INDONESIA
1260        2019  25.209832165788                   INDONESIA

[1259 rows x 3 columns]

### Menghapus baris relatif terhadap urutannya dari baris terakhir

In [25]:
df_aps.tail()

      nama_tahun     data_content nama_item_vertical_variabel
1256        2019  31.232309871373                MALUKU UTARA
1257        2019  31.476599698978                 PAPUA BARAT
1258        2019  22.912638443325                       PAPUA
1259        2019  25.209832165788                   INDONESIA
1260        2019  25.209832165788                   INDONESIA

In [26]:
df_aps.drop(df_aps.index[-2])

      nama_tahun     data_content nama_item_vertical_variabel
0           2011            98.99                        ACEH
1           2011            98.34              SUMATERA UTARA
2           2011            98.09              SUMATERA BARAT
3           2011            97.68                        RIAU
4           2011              NaN                       JAMBI
...          ...              ...                         ...
1255        2019   38.57931230147                      MALUKU
1256        2019  31.232309871373                MALUKU UTARA
1257        2019  31.476599698978                 PAPUA BARAT
1258        2019  22.912638443325                       PAPUA
1260        2019  25.209832165788                   INDONESIA

[1260 rows x 3 columns]

##  Mengubah nama kolom

üìñ  Dokumentasi `pandas.DataFrame.rename`: [tautan](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html)

In [27]:
df_aps = df_aps.rename(columns = {"data_content": "nilai",
                                  "nama_item_vertical_variabel": "provinsi"})

In [28]:
df_aps.head()

   nama_tahun  nilai        provinsi
0        2011  98.99            ACEH
1        2011  98.34  SUMATERA UTARA
2        2011  98.09  SUMATERA BARAT
3        2011  97.68            RIAU
4        2011    NaN           JAMBI

In [29]:
df_aps.columns

Index(['nama_tahun', 'nilai', 'provinsi'], dtype='object')

# Menangani baris duplikat

### Mengidentifikasi baris duplikat dengan `pandas.DataFrame.duplicated`

Untuk menangani baris-baris yang merupakan duplikat, tentu kita perlu untuk mencari tahu apakah terdapat baris duplikat di data kita atau tidak.

üìñ  Dokumentasi `pandas.DataFrame.duplicated`: [tautan](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.duplicated.html)

In [30]:
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";")

Metode `duplicated()` akan mengembalikan data bertipe *series* yang menunjukkan apakah baris tersebut benar merupakan sebuah duplikat atau bukan.

In [31]:
df_aps.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1256    False
1257    False
1258    False
1259    False
1260     True
Length: 1261, dtype: bool

Pada contoh di atas, terlihat bahwa baris terakhir merupakan sebuah duplikat. Artinya, ada baris yang sama persis dengan baris tersebut muncul di baris-baris sebelumnya.

Untuk mencari tahu baris apakah yang merupakan sebuah duplikat, masukkan *series* tersebut ke operator `[]` untuk memilih baris-baris di mana `duplicated()` = `True`.

In [32]:
df_aps[df_aps.duplicated()]

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

Untuk melihat semua baris yang duplikat (termasuk baris yang muncul pertama kali), gunakan `keep`. `keep` menunjukkan baris-baris mana sajakah yang harus ditandai sebagai duplikat. `keep` dapat bernilai "first", "last", atau `False`.
- `keep` = "first": seluruh duplikat, kecuali baris yang muncul pertama, akan ditandai sebagai duplikat
- `keep` = "last": seluruh duplikat, kecuali baris yang muncul terakhir, akan ditandai sebagai duplikat
- `keep` = False: seluruh duplikat akan ditandai sebagai duplikat

In [33]:
df_aps[df_aps.duplicated(keep=False)]

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

Seringkali, kita tidak membutuhkan semua kolom untuk menentukan apakah sebuah baris merupakan duplikat atau bukan. Sebagai contoh, pada dataset yang kita gunakan, mungkin tidak masuk akal apabila terdapat lebih dari satu data untuk kabupaten dan tingkat sekolah serta tahun yang sama, meksipun nilainya berbeda. Bisa jadi kita akan menganggap bahwa hanya salah satu nilai yang benar--misalnya, nilai di baris terakhir, dengan anggapan bahwa nilai di baris terakhir adalah nilai yang paling *up-to-date*.

In [34]:
df_aps[df_aps.duplicated(subset=["nama_variabel_turunan", "nama_tahun", "nama_item_vertical_variabel"], keep=False)]

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

Pada contoh di atas, dengan bantuan `duplicated()` dan `keep=False`, kita dapat menemukan bahwa terdapat dua nilai yang berbeda untuk kabupaten, tingkat sekolah, dan tahun yang sama.

üìñ  Dokumentasi `pandas.DataFrame.drop_duplicates`: [tautan](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.duplicated.html)

Secara *default*, `drop_duplicates()` menghapus baris-baris duplikat berdasarkan seluruh kolom, dengan parameter *default* `keep=First`. Jadi, seluruh baris duplikat akan dihapus kecuali baris yang muncul pertama kali.

In [35]:
df_aps_no_dup = df_aps.drop_duplicates()

Kita dapat menggunakan `duplicated()` untuk mengecek apakah masih ada baris-baris duplikat yang tersisa atau tidak.

In [36]:
df_aps_no_dup.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1255    False
1256    False
1257    False
1258    False
1259    False
Length: 1260, dtype: bool

In [37]:
df_aps_no_dup[df_aps_no_dup.duplicated()]

Empty DataFrame
Columns: [nama_variabel, nama_variabel_turunan, nama_tahun, nama_turunan_tahun, data_content, nama_item_vertical_variabel]
Index: []

# Meng-*handle missing values*
*Missing values* bisa terjadi karena:
- Pengguna lupa untuk mengisi *field*.
- Data hilang ketika melakukan integrasi/transfer.
- Ada *error* dalam kode.

Penting untuk mengetahui alasan mengapa sebuah data dapat hilang, karena ini dapat memengaruhi metode pengisian *missing data*. 

Lebih lanjut tentang ini: [tautan](https://github.com/matthewbrems/ODSC-missing-data-may-18/blob/master/Analysis%20with%20Missing%20Data.pdf?source=post_page---------------------------)

In [38]:
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";")

### *Missing value* dengan bentuk standar

Pandas menganggap cell yang kosong maupun cell berisi "NA" sebagai cell yang kosong. Anda bisa melihat di *file* `data/angka_partisipasi_sekolah.csv` bahwa data nilai di Kabupaten Polewali Mandar untuk tingkat Sekolah Menengah Umum di tahun 2013 tertulis "NA". Apabila Anda lihat pada tabel di bawah, pandas dapat langsung membacanya sebagai sebuah *missing value* (NaN).

In [39]:
df_aps

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI
...,...,...,...,...,...,...
1256,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.232309871373,MALUKU UTARA
1257,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.476599698978,PAPUA BARAT
1258,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,22.912638443325,PAPUA
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

In [40]:
df_aps[df_aps["data_content"].isnull()]

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI
23,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,KALIMANTAN UTARA

Terkadang, pada data yang kita miliki, *missing value* tidak ditandai dengan "NA" atau tidak dibiarkan kosong, melainkan ditandai dengan tanda "-". Kita dapat memberitahu pandas untuk membaca *cell* berisi karakter "-" sebagai *missing value* dengan mendefinisikan `na_values` pada `read_csv()`.

Pada contoh di bawah, kita memberitahu pandas untuk membaca *cell* berisi karakter "-" dan "--" sebagai *missing value*.

In [41]:
missing_values = ["-", "--"]
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";", na_values=missing_values)

In [42]:
df_aps[df_aps["data_content"].isnull()]

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI
7,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,LAMPUNG
23,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,KALIMANTAN UTARA
58,Angka Partisipasi Sekolah ( A P S ),13-15,2011,Tahun,NaN,KALIMANTAN UTARA
93,Angka Partisipasi Sekolah ( A P S ),16-18,2011,Tahun,NaN,KALIMANTAN UTARA
128,Angka Partisipasi Sekolah ( A P S ),19-24,2011,Tahun,NaN,KALIMANTAN UTARA
163,Angka Partisipasi Sekolah ( A P S ),7-12,2012,Tahun,NaN,KALIMANTAN UTARA
198,Angka Partisipasi Sekolah ( A P S ),13-15,2012,Tahun,NaN,KALIMANTAN UTARA
233,Angka Partisipasi Sekolah ( A P S ),16-18,2012,Tahun,NaN,KALIMANTAN UTARA
268,Angka Partisipasi Sekolah ( A P S ),19-24,2012,Tahun,NaN,KALIMANTAN UTARA
303,Angka Partisipasi Sekolah ( A P S ),7-12,2013,Tahun,NaN,KALIMANTAN UTARA
338,Angka Partisipasi Sekolah ( A P S ),13-15,2013,Tahun,NaN,KALIMANTAN UTARA
373,Angka Partisipasi Sekolah ( A P S ),16-18,2013,Tahun,NaN,KALIMANTAN UTARA
408,Angka Partisipasi Sekolah ( A P S ),19-24,2013,Tahun,NaN,KALIMANTAN UTARA
443,Angka Partisipasi Sekolah ( A P S ),7-12,2014,Tahun,NaN,KALIMANTAN UTARA
478,Angka Partisipasi Sekolah ( A P S ),13-15,2014,Tahun,NaN,KALIMANTAN UTARA
513,Angka Partisipasi Sekolah ( A P S ),16-18,2014,Tahun,NaN,KALIMANTAN UTARA
548,Angka Partisipasi Sekolah ( A P S ),19-24,2014,Tahun,NaN,KALIMANTAN UTARA

Menghitung berapa jumlah *missing value* di masing-masing kolom:

In [43]:
df_aps.isnull().sum()

nama_variabel                   0
nama_variabel_turunan           0
nama_tahun                      0
nama_turunan_tahun              0
data_content                   18
nama_item_vertical_variabel     1
dtype: int64

Mencari tahu apakah ada *missing value* di antara semua kolom yang ada pada data:

In [44]:
df_aps.isnull().values.any()

True

Mencari tahu berapakah *missing value* yang terdapat di antara semua kolom yang ada pada data:

In [45]:
df_aps.isnull().sum().sum()

19

Selanjutnya, kita akan membahas berbagai metode untuk pengisian *missing value* dan bagaimana kita dapat mengimplementasikannya menggunakan pandas.

‚ö†Ô∏è Metode pengisian *missing value* yang sebaiknya digunakan bergantung pada data Anda serta konteks analisis yang ingin Anda lakukan. Pembahasan tentang hal tersebut berada di luar *scope* dari *notebook* ini, namun Anda dapat merujuk ke [tautan ini](https://github.com/matthewbrems/ODSC-missing-data-may-18/blob/master/Analysis%20with%20Missing%20Data.pdf?source=post_page---------------------------) untuk mencari tahu lebih lanjut.

### Mengganti *missing value* dengan sebuah nilai

In [46]:
missing_values = ["-", "--"]
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";", na_values=missing_values)

In [47]:
df_aps.head()

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI

Mengganti semua *missing value* dengan nilai 125:

In [48]:
df_aps.fillna(125)

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,125,JAMBI
...,...,...,...,...,...,...
1256,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.232309871373,MALUKU UTARA
1257,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.476599698978,PAPUA BARAT
1258,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,22.912638443325,PAPUA
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

### Mengganti *missing value* dengan sebuah nilai pada lokasi tertentu

In [49]:
missing_values = ["-", "--"]
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";", na_values=missing_values)

Mengganti *missing value* dengan indeks `3` menjadi 129:

In [50]:
df_aps.loc[3, "data_content"] = 129

In [51]:
df_aps

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,129,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI
...,...,...,...,...,...,...
1256,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.232309871373,MALUKU UTARA
1257,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.476599698978,PAPUA BARAT
1258,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,22.912638443325,PAPUA
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

### Mengganti *missing value* dengan nilai di baris berikutnya

In [52]:
missing_values = ["-", "--"]
df_aps = pd.read_csv("data/angka_partisipasi_sekolah.csv", sep=";", na_values=missing_values)

Kita dapat mengganti *missing value* dengan nilai di baris berikutnya. Sebagai contoh, pada tabel di bawah ini, kolom nilai di baris ke-4 (indeks `3`) akan diisi dengan nilai yang ada di baris berikutnya, yaitu 98.22.

In [53]:
df_aps

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,NaN,JAMBI
...,...,...,...,...,...,...
1256,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.232309871373,MALUKU UTARA
1257,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.476599698978,PAPUA BARAT
1258,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,22.912638443325,PAPUA
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

In [54]:
df_aps.fillna(method ='bfill')

,nama_variabel,nama_variabel_turunan,nama_tahun,nama_turunan_tahun,data_content,nama_item_vertical_variabel
0,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.99,ACEH
1,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.34,SUMATERA UTARA
2,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,98.09,SUMATERA BARAT
3,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.68,RIAU
4,Angka Partisipasi Sekolah ( A P S ),7-12,2011,Tahun,97.95,JAMBI
...,...,...,...,...,...,...
1256,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.232309871373,MALUKU UTARA
1257,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,31.476599698978,PAPUA BARAT
1258,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,22.912638443325,PAPUA
1259,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA
1260,Angka Partisipasi Sekolah ( A P S ),19-24,2019,Tahun,25.209832165788,INDONESIA

Di awal, terdapat *missing value* di baris ke-7 (indeks `6`) dan baris ke-8 (indeks `7`). Ketika kita menggunakan `method ='bfill'`, baris ke-8 akan diisi terlebih dahulu mengikuti nilai di baris ke-9 (indeks `8`), dan kemudian baris ke-7 akan mengikuti nilai baru di baris ke-8.

# *Checkpoint*
- Menghapus kolom (del, drop)
- Menghapus baris (berdasarkan indeks, nilai di kolom, nomor baris...)
- Mengubah nama kolom
- Menangani baris duplikat (identifikasi dan penghapusan)
- Meng-handle *missing values* (membaca berbagai jenis *missing value*, mengubah *missing value* menjadi sebuah nilai, dll.)

![alt text](https://media3.giphy.com/media/12XDYvMJNcmLgQ/giphy.gif?cid=790b76115d4482dd58414a5049302fa6&rid=giphy.gif)